In [1]:
import sqlite3

In [2]:
# connect to an SQLite database
connection=sqlite3.connect("example.db")
connection

In [3]:
cursor=connection.cursor()

In [4]:
##create a  table
cursor.execute('''
               create  Table if Not Exists employee(
                   id Integer Primary Key,
                   name Text Not Null,
                   age Integer,
                   department text 
               )
               ''')
connection.commit()

In [5]:
cursor.execute('''
               select * from employee
               
               
               
               ''')

In [6]:
cursor.execute('''
               Insert Into employee(name,age,department)
               values('srav',19,'data scientist')
               
               ''')
cursor.execute('''
               Insert Into employee(name,age,department)
               values('venky',20,'data scientist')
               
               ''')
cursor.execute('''
               Insert Into employee(name,age,department)
               values('durgi',18,'data scientist')
               
               ''')
##commit the changes
connection.commit()

In [7]:
### query the data from the table
cursor.execute('select * from employee')
rows=cursor.fetchall()
for row in rows:
    print(row)

(1, 'srav', 19, 'data scientist')
(2, 'venky', 20, 'data scientist')
(3, 'durgi', 18, 'data scientist')

In [8]:
##update the data in the table
cursor.execute('''
        UPDATE employee
        set age=34
        where name="srav"       
               
               ''')
connection.commit()

In [9]:
### query the data from the table
cursor.execute('select * from employee')
rows=cursor.fetchall()
for row in rows:
    print(row)

(1, 'srav', 34, 'data scientist')
(2, 'venky', 20, 'data scientist')
(3, 'durgi', 18, 'data scientist')

In [10]:
##DELETE THE DATA FROM THE TABLE

In [11]:
cursor.execute('''
        Delete from employee where name='durgi'  
               
               ''')
connection.commit()

In [12]:
### query the data from the table
cursor.execute('select * from employee')
rows=cursor.fetchall()
for row in rows:
    print(row)

(1, 'srav', 34, 'data scientist')
(2, 'venky', 20, 'data scientist')

In [13]:
connection=sqlite3.connect('sales_data.db')
cursor=connection.cursor()

cursor.execute('''
    CREATE TABLE IF NOT EXISTS sales(
        id INTEGER PRIMARY KEY,
        DATE TEXT NOT NULL,
        PRODUCT TEXT NOT NULL,
        SALES INTEGER,
        REGION TEXT 
    )                     
     ''')
sales_data=[('2023-01-01','PRODUCT1',100,'NORTH'),
            ('2023-01-02','PRODUCT1',200,'SORTH'),
            ('2023-01-03','PRODUCT1',150,'WEST'),
            ('2023-01-04','PRODUCT1',250,'WEST'),
            ('2023-01-01','PRODUCT1',300,'NORTH')]
# connection.commit()
cursor.executemany('''
                   Insert into sales(DATE,PRODUCT,SALES,REGION)
                   values(?,?,?,?)
                   ''',sales_data)
connection.commit()

In [14]:
### query the data from the table
cursor.execute('select * from sales')
rows=cursor.fetchall()
for row in rows:
    print(row)

(1, '2023-01-01', 'PRODUCT1', 100, 'NORTH')
(2, '2023-01-02', 'PRODUCT1', 200, 'SORTH')
(3, '2023-01-03', 'PRODUCT1', 150, 'WEST')
(4, '2023-01-04', 'PRODUCT1', 250, 'WEST')
(5, '2023-01-01', 'PRODUCT1', 300, 'NORTH')

In [15]:
connection.close()

In [16]:
cursor.execute('select * from sales')
rows=cursor.fetchall()
for row in rows:
    print(row)

ProgrammingError: Cannot operate on a closed database.